import numpy as np

# Задані дані
F = np.array([
[3, 6, 5, 6],
[1, 3, 9, 5],
[4, 1, 8, 4]
])

P = np.array([0.2, 0.3, 0.25, 0.25])

# Критерій Ходжеса-Лемана
HL = np.dot(P, np.min(F, axis=0))

print("Значення критерію Ходжеса-Лемана:", HL)

# Модифікований критерій
E = np.dot(P, F.T)

print("Середнє значення виграшу для кожного варіанту рішення:", E)

# Знайти індекс варіанту рішення з найменшим середнім значенням виграшу
best_decision = np.argmin(E)

print("Найкращий варіант рішення за модифікованим критерієм:", best_decision + 1)